# Brewfile — intentionally installed packages only
# Managed by bi/bd scripts. Do NOT use `brew bundle dump` to overwrite.
# Run `brewdump` for a full-state audit snapshot.

# Taps
tap "madappgang/claudish"
tap "wix/brew"

# Formulae
brew "bat"
brew "btop"
brew "ccusage"
brew "cmake"
brew "cocoapods"
brew "eslint"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git-delta"
brew "gitleaks"
brew "glow"
brew "hashcat"
brew "jq"
brew "just"
brew "lazygit"
brew "less"
brew "lynx"
brew "markdown-oxide"
brew "marksman"
brew "neovim"
brew "ninja"
brew "nmap"
brew "nvm"
brew "opencode"
brew "openjdk@17"
brew "p7zip"
brew "pipx"
brew "posting"
brew "rbenv"
brew "speedtest-cli"
brew "starship"
brew "stow"
brew "tmux"
brew "watchman"
brew "wget"
brew "wix/brew/applesimutils"
brew "yarn"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"

# Casks
cask "aldente"
cask "docker-desktop"
cask "ghostty"
cask "linearmouse"
cask "ngrok"
cask "obsidian"
cask "ollama-app"
cask "omnidisksweeper"
cask "onyx"
cask "raycast"
cask "shortcat"
cask "warp"
cask "zed"

cask "qlmarkdown"
# Cargo
unless `scutil --get LocalHostName`.strip == "DarkWolf"
  cargo "cargo-espflash"
  cargo "cargo-generate"
  cargo "espflash"
  cargo "espup"
  cargo "helix-term"
  cargo "ldproxy"
  cargo "mdpls"
end
